package com.example.myfirstgameprojectkotlin

//1. Создать структуру классов и их отношений. Потратить значительное количество времени
//2. Стараться не передавать Context как параметр в конструктор. Это может вызвать утечку памяти. Лучше сразу цвет.
//3. Стараться разбивать функции на более мелкие.
//4. Инициализировать сразу. В блоке init обычно делаются только вещи, которые сразу должны выполняться при создании объекта.
//5. Продумать иерархии наследовании. Может, отказаться от наследования в пользу композиции.
//6. Тщательнее подбирать названия.
//7. Data классы
//8. Использовать функции области видимости: run, apply, let, with, also, use